Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/hal_drv/src/hal_sec_ecdsa.c
    //8*B
    //PKA_MMUL(0,3, 5,3,12,3,15,3,0);
    Sec_Eng_PKA_MMUL(3, 5, 3, 12, 3, 15, 3, 0, 0);

    //H = W^2-8*B
    //PKA_MSUB(0,3, 7,3, 7,3, 5,3,0);
    Sec_Eng_PKA_MSUB(3, 7, 3, 7, 3, 5, 3, 0, 0);

    //2*H
    //PKA_MMUL(0,3, 5,3, 9,3, 7,3,0);
    Sec_Eng_PKA_MMUL(3, 5, 3, 9, 3, 7, 3, 0, 0);

    //X2 = 2*H*S
    //PKA_MMUL(0,3, 5,3, 5,3,14,3,0);
    Sec_Eng_PKA_MMUL(3, 5, 3, 5, 3, 14, 3, 0, 0);

    //4*B
    //PKA_MMUL(0,3,15,3,11,3,15,3,0);
    Sec_Eng_PKA_MMUL(3, 15, 3, 11, 3, 15, 3, 0, 0);

    //S^2
    //PKA_MMUL(0,3,16,3,14,3,14,3,0);
    Sec_Eng_PKA_MMUL(3, 16, 3, 14, 3, 14, 3, 0, 0);

    //4*B-H
    //PKA_MSUB(0,3,15,3,15,3, 7,3,0);
    Sec_Eng_PKA_MSUB(3, 15, 3, 15, 3, 7, 3, 0, 0);

    //Y1^2
    //PKA_MMUL(0,3, 6,3, 6,3, 6,3,0);
    Sec_Eng_PKA_MMUL(3, 6, 3, 6, 3, 6, 3, 0, 0);

    //W*(4*B-H)
    //PKA_MMUL(0,3,15,3,15,3,13,3,0);
    Sec_Eng_PKA_MMUL(3, 15, 3, 15, 3, 13, 3, 0, 0);

    //8*Y1^2
    //PKA_MMUL(0,3, 6,3,12,3, 6,3,0);
    Sec_Eng_PKA_MMUL(3, 6, 3, 12, 3, 6, 3, 0, 0);

    //8*Y1^2*S^2
    //PKA_MMUL(0,3, 6,3, 6,3,16,3,0);
    Sec_Eng_PKA_MMUL(3, 6, 3, 6, 3, 16, 3, 0, 0);

    //Y2 = W*(4*B-H)-8*Y1^2*S^2
    //PKA_MSUB(0,3, 6,3,15,3, 6,3,0);
    Sec_Eng_PKA_MSUB(3, 6, 3, 15, 3, 6, 3, 0, 0);

    //S^3
    //PKA_MMUL(0,3, 7,3,14,3,16,3,0);
    Sec_Eng_PKA_MMUL(3, 7, 3, 14, 3, 16, 3, 0, 0);

    //Z2 = 8*S^3
    //PKA_MMUL(1,3, 7,3,12,3, 7,3,0);
    Sec_Eng_PKA_MMUL(3, 7, 3, 12, 3, 7, 3, 0, 1);
}
#ifdef ECDSA_DBG_DETAIL
static void sec_ecdsa_dump_temp_result()
{
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE, 2, (uint32_t *)pka_tmp, ECP_SECP256R1_SIZE / 4);
    MSG("2=\r\n");
    bflb_platform_dump(pka_tmp, ECP_SECP256R1_SIZE);
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE, 3, (uint32_t *)pka_tmp, ECP_SECP256R1_SIZE / 4);
    MSG("3=\r\n");
    bflb_platform_dump(pka_tmp, ECP_SECP256R1_SIZE);
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE, 4, (uint32_t *)pka_tmp, ECP_SECP256R1_SIZE / 4);
    MSG("4=\r\n");
    bflb_platform_dump(pka_tmp, ECP_SECP256R1_SIZE);

    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE, 5, (uint32_t *)pka_tmp, ECP_SECP256R1_SIZE / 4);
    MSG("5=\r\n");
    bflb_platform_dump(pka_tmp, ECP_SECP256R1_SIZE);
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE, 6, (uint32_t *)pka_tmp, ECP_SECP256R1_SIZE / 4);
    MSG("6=\r\n");
    bflb_platform_dump(pka_tmp, ECP_SECP256R1_SIZE);
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE, 7, (uint32_t *)pka_tmp, ECP_SECP256R1_SIZE / 4);
    MSG("7=\r\n");
    bflb_platform_dump(pka_tmp, ECP_SECP256R1_SIZE);
}
#endif
static int sec_ecdsa_verify_point_mul(uint8_t id, const uint32_t *m)
{
    uint32_t i, j, k;
    uint32_t tmp;
    uint32_t isOne = 0;
    uint8_t *p = (uint8_t *)m;
    uint8_t pka_p1_eq_inf, pka_p2_eq_inf;

    /* Remove zeros bytes*/
    k = 0;

    while (p[k] == 0 && k < 31) {
        k++;
    }

    i = 31;

    for (; i >= k; i--) {
        tmp = p[i];
        j = 0;

        for (j = 0; j < 8; j++) {
            isOne = tmp & (1 << j);

            if (isOne) {
                sec_ecdsa_point_add_inf_check(&pka_p1_eq_inf, &pka_p2_eq_inf);

                if (pka_p1_eq_inf == 1 && pka_p2_eq_inf == 0) {
                    //sum = X2
                    sec_ecdsa_copy_x2_to_x1(id);
#ifdef ECDSA_DBG_DETAIL
                    MSG("sum = X2\r\n");
                    sec_ecdsa_dump_temp_result();
#endif
                } else if (pka_p1_eq_inf == 0 && pka_p2_eq_inf == 1) {
                    //sum = X1
                    //MSG("sum = X1\r\n");
                } else if (pka_p1_eq_inf == 0 && pka_p2_eq_inf == 0) {
                    //sum = X1 + X2
                    sec_ecdsa_point_add(id);
#ifdef ECDSA_DBG_DETAIL
                    MSG("sum = X1+X2\r\n");
                    sec_ecdsa_dump_temp_result();
#endif
                } else {
                    //MSG("Error! infinite point + infinite point\r\n");
                    return -1;
                }
            }

            sec_ecdsa_point_double(id);
#ifdef ECDSA_DBG_DETAIL
            sec_ecdsa_dump_temp_result();
#endif
        }

        if (i == 0) {
            break;
        }
    }

    return 0;
}

/*cal d*G if pkX(pky)==NULL
 * cal d(bG) if pkX(pky)!=NULL */
static int32_t sec_ecdh_get_scalar_point(uint8_t id, const uint32_t *pkX, const uint32_t *pkY, const uint32_t *private_key, const uint32_t *pRx, const uint32_t *pRy)
{
#ifdef ECDSA_DBG
    uint32_t pk_z[8];
#endif

    /* Pointer check */
    if (private_key == NULL) {
        return -1;
    }

    Sec_Eng_PKA_Reset();
    Sec_Eng_PKA_BigEndian_Enable();

    sec_ecc_basic_parameter_init(id);

    //Clear D[7]
    //PKA_CREG(1,4, 7,0);
    Sec_Eng_PKA_CREG(ECP_SECP256R1_LT_REG_TYPE, 7, ECP_SECP256R1_SIZE / 4, 1);

    sec_ecc_point_mul_init(id);

    //X1
    //PKA_CTREG(3, 2,8,bar_Zero_x);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE, 2, (uint32_t *)secp256r1_Zerox, ECP_SECP256R1_SIZE / 4, 0);
    //Y1
    //PKA_CTREG(3, 3,8,bar_Zero_y);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE, 3, (uint32_t *)secp256r1_Zeroy, ECP_SECP256R1_SIZE / 4, 0);
    //Z1
    //PKA_CTREG(3, 4,8,bar_Zero_z);
    //PKA_MOVDAT(1,3, 4,3, 2);
    Sec_Eng_PKA_Move_Data(3, 4, 3, 2, 1);

    if (pkX == NULL) {
        //X2
        //PKA_CTREG(3, 5,8,bar_G_x);
        Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE, 5, (uint32_t *)secp256r1_Gx, ECP_SECP256R1_SIZE / 4, 0);
        //Y2
        //PKA_CTREG(3, 6,8,bar_G_y);
        Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE, 6, (uint32_t *)secp256r1_Gy, ECP_SECP256R1_SIZE / 4, 0);
    } else {
        /* chaneg peer's public key to mont domain*/
        //PUB_x
        //PKA_CTREG(3, 5,8,PUB_x);
        Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE, 5, (uint32_t *)pkX, ECP_SECP256R1_SIZE / 4, 0);
        //bar_pub_x
        //PKA_GF2MONT(3, 5,3, 5);
        /* Change s to Mont domain,remember to clear temp register and index 0 is P256*/
        /* Clear register for ECP_SECP256R1_LT_REG_INDEX*/
        Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE, 2 * ECP_SECP256R1_LT_REG_INDEX - 1, ECP_SECP256R1_SIZE / 4, 1);
        Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE, 2 * ECP_SECP256R1_LT_REG_INDEX, ECP_SECP256R1_SIZE / 4, 1);
        Sec_Eng_PKA_GF2Mont(ECP_SECP256R1_REG_TYPE, 5, ECP_SECP256R1_REG_TYPE, 5, 256,
                            ECP_SECP256R1_LT_REG_TYPE, ECP_SECP256R1_LT_REG_INDEX, ECP_SECP256R1_REG_TYPE, 0);
#ifdef ECDSA_DBG
        Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE, 5, (uint32_t *)pka_tmp, ECP_SECP256R1_SIZE / 4);
        MSG("PK.x in Mont:\r\n");
        bflb_platform_dump(pka_tmp, ECP_SECP256R1_SIZE);
#endif

        //PUB_y
        //PKA_CTREG(3, 6,8,PUB_y);
        Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE, 6, (uint32_t *)pkY, ECP_SECP256R1_SIZE / 4, 0);
        //bar_pub_y
        //PKA_GF2MONT(3, 6,3, 6);
        Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE, 2 * ECP_SECP256R1_LT_REG_INDEX - 1, ECP_SECP256R1_SIZE / 4, 1);
        Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE, 2 * ECP_SECP256R1_LT_REG_INDEX, ECP_SECP256R1_SIZE / 4, 1);
        Sec_Eng_PKA_GF2Mont(ECP_SECP256R1_REG_TYPE, 6, ECP_SECP256R1_REG_TYPE, 6, 256,
                            ECP_SECP256R1_LT_REG_TYPE, ECP_SECP256R1_LT_REG_INDEX, ECP_SECP256R1_REG_TYPE, 0);
#ifdef ECDSA_DBG
        Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE, 6, (uint32_t *)pka_tmp, ECP_SECP256R1_SIZE / 4);
        MSG("PK.y in Mont:\r\n");
        bflb_platform_dump(pka_tmp, ECP_SECP256R1_SIZE);
#endif
    }

    //Z2
    //PKA_CTREG(3, 7,8,bar_G_z);
    //PKA_MOVDAT(1,3, 7,3, 3);
    Sec_Eng_PKA_Move_Data(3, 7, 3, 3, 1);
    /* Clear temp register since it's used in point-mul*/
    Sec_Eng_PKA_CREG(ECP_SECP256R1_LT_REG_TYPE, 7, ECP_SECP256R1_SIZE / 4, 1);

    sec_ecdsa_verify_point_mul(id, private_key);
    //get bar_u1_x
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE, 2, (uint32_t *)pRx, ECP_SECP256R1_SIZE / 4);
#ifdef ECDSA_DBG
    MSG("bar_u1_x\r\n");
    bflb_platform_dump(pRx, ECP_SECP256R1_SIZE);
#endif
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE, 3, (uint32_t *)pRy, ECP_SECP256R1_SIZE / 4);
#ifdef ECDSA_DBG
    MSG("bar_u1_y\r\n");
    bflb_platform_dump(pRy, ECP_SECP256R1_SIZE);
#endif
#ifdef ECDSA_DBG
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE, 4, (uint32_t *)pk_z, ECP_SECP256R1_SIZE / 4);
    MSG("bar_u1_z\r\n");
    bflb_platform_dump(pk_z, ECP_SECP256R1_SIZE);
#endif

    //get R.x
    //R.z ^ -1
    Sec_Eng_PKA_MINV(ECP_SECP256R1_REG_TYPE, 5, ECP_SECP256R1_REG_TYPE, 4, ECP_SECP256R1_REG_TYPE, 0, 1);
    //inv_r
    //PKA_CTREG(3, 6,8,inv_r);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE, 6, (uint32_t *)secp256r1InvR_P, ECP_SECP256R1_SIZE / 4, 0);
    //R.z ^ -1
    Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE, 2 * ECP_SECP256R1_LT_REG_INDEX - 1, ECP_SECP256R1_SIZE / 4, 1);
    Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE, 2 * ECP_SECP256R1_LT_REG_INDEX, ECP_SECP256R1_SIZE / 4, 1);
    //PKA_MONT2GF(3, 5,3, 5,3, 6);
    Sec_Eng_PKA_Mont2GF(ECP_SECP256R1_REG_TYPE, 5, ECP_SECP256R1_REG_TYPE, 5, ECP_SECP256R1_REG_TYPE, 6,
                        ECP_SECP256R1_LT_REG_TYPE, ECP_SECP256R1_LT_REG_INDEX, ECP_SECP256R1_REG_TYPE, 0);

    //R.x (Montgomery to GF)
    //PKA_MONT2GF(3, 6,3, 2,3, 6);
    Sec_Eng_PKA_Mont2GF(ECP_SECP256R1_REG_TYPE, 6, ECP_SECP256R1_REG_TYPE, 2, ECP_SECP256R1_REG_TYPE, 6,
                        ECP_SECP256R1_LT_REG_TYPE, ECP_SECP256R1_LT_REG_INDEX, ECP_SECP256R1_REG_TYPE, 0);

