Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/hal_drv/src/hal_sec_ecdsa.c
    //PUB_x
    //PKA_CTREG(3, 5,8,PUB_x);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE, 5, (uint32_t *)handle->publicKeyx, ECP_SECP256R1_SIZE / 4, 0);
    //bar_pub_x
    //PKA_GF2MONT(3, 5,3, 5);
    /* Change s to Mont domain,remember to clear temp register and index 0 is P256*/
    /* Clear register for ECP_SECP256R1_LT_REG_INDEX*/
    Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE, 2 * ECP_SECP256R1_LT_REG_INDEX - 1, ECP_SECP256R1_SIZE / 4, 1);
    Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE, 2 * ECP_SECP256R1_LT_REG_INDEX, ECP_SECP256R1_SIZE / 4, 1);
    Sec_Eng_PKA_GF2Mont(ECP_SECP256R1_REG_TYPE, 5, ECP_SECP256R1_REG_TYPE, 5, 256,
                        ECP_SECP256R1_LT_REG_TYPE, ECP_SECP256R1_LT_REG_INDEX, ECP_SECP256R1_REG_TYPE, 0);
#ifdef ECDSA_DBG
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE, 5, (uint32_t *)pka_tmp, ECP_SECP256R1_SIZE / 4);
    MSG("PK.x in Mont:\r\n");
    bflb_platform_dump(pka_tmp, ECP_SECP256R1_SIZE);
#endif

    //PUB_y
    //PKA_CTREG(3, 6,8,PUB_y);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE, 6, (uint32_t *)handle->publicKeyy, ECP_SECP256R1_SIZE / 4, 0);
    //bar_pub_y
    //PKA_GF2MONT(3, 6,3, 6);
    Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE, 2 * ECP_SECP256R1_LT_REG_INDEX - 1, ECP_SECP256R1_SIZE / 4, 1);
    Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE, 2 * ECP_SECP256R1_LT_REG_INDEX, ECP_SECP256R1_SIZE / 4, 1);
    Sec_Eng_PKA_GF2Mont(ECP_SECP256R1_REG_TYPE, 6, ECP_SECP256R1_REG_TYPE, 6, 256,
                        ECP_SECP256R1_LT_REG_TYPE, ECP_SECP256R1_LT_REG_INDEX, ECP_SECP256R1_REG_TYPE, 0);
#ifdef ECDSA_DBG
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE, 6, (uint32_t *)pka_tmp, ECP_SECP256R1_SIZE / 4);
    MSG("PK.y in Mont:\r\n");
    bflb_platform_dump(pka_tmp, ECP_SECP256R1_SIZE);
#endif

    //bar_pub_z
    //PKA_CTREG(3, 7,8,PUB_z);
    //PKA_MOVDAT(1,3, 7,3, 3);
    Sec_Eng_PKA_Move_Data(3, 7, 3, 3, 1);

    /* Clear temp register since it's used in point-mul*/
    Sec_Eng_PKA_CREG(ECP_SECP256R1_LT_REG_TYPE, 7, ECP_SECP256R1_SIZE / 4, 1);

    sec_ecdsa_verify_point_mul(handle->ecpId, pka_u2);
    //get bar_u1_x
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE, 2, (uint32_t *)bar_u2_x, ECP_SECP256R1_SIZE / 4);
#ifdef ECDSA_DBG
    MSG("bar_u2_x\r\n");
    bflb_platform_dump(bar_u2_x, ECP_SECP256R1_SIZE);
#endif
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE, 3, (uint32_t *)bar_u2_y, ECP_SECP256R1_SIZE / 4);
#ifdef ECDSA_DBG
    MSG("bar_u2_y\r\n");
    bflb_platform_dump(bar_u2_y, ECP_SECP256R1_SIZE);
#endif
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE, 4, (uint32_t *)bar_u2_z, ECP_SECP256R1_SIZE / 4);
#ifdef ECDSA_DBG
    MSG("bar_u2_z\r\n");
    bflb_platform_dump(bar_u2_z, ECP_SECP256R1_SIZE);
#endif

    /* Step5: Get u1*G+u2*Q*/
    //move bar_u2_x
    //PKA_MOVDAT(0,3, 5,3, 2);
    Sec_Eng_PKA_Move_Data(3, 5, 3, 2, 0);
    //move bar_u2_y
    //PKA_MOVDAT(0,3, 6,3, 3);
    Sec_Eng_PKA_Move_Data(3, 6, 3, 3, 0);
    //move bar_u2_z
    //PKA_MOVDAT(1,3, 7,3, 4);
    Sec_Eng_PKA_Move_Data(3, 7, 3, 4, 1);

    //bar_u1_x
    //PKA_CTREG(3, 2,8,bar_u1_x);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE, 2, (uint32_t *)bar_u1_x, ECP_SECP256R1_SIZE / 4, 0);
    //bar_u1_y
    //PKA_CTREG(3, 3,8,bar_u1_y);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE, 3, (uint32_t *)bar_u1_y, ECP_SECP256R1_SIZE / 4, 0);
    //bar_u1_z
    //PKA_CTREG(3, 4,8,bar_u1_z);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE, 4, (uint32_t *)bar_u1_z, ECP_SECP256R1_SIZE / 4, 0);

    //R = u1 * G + u2 * PUB
    //PKA_POINT_ADDITION();
    sec_ecdsa_point_add(handle->ecpId);

    /* Step6 Get R.x(R=u1G+u2P)*/
    //R.z ^ -1
    //PKA_MINV(0,3, 5,3, 4,3, 0);
    Sec_Eng_PKA_MINV(ECP_SECP256R1_REG_TYPE, 5, ECP_SECP256R1_REG_TYPE, 4, ECP_SECP256R1_REG_TYPE, 0, 1);
    //inv_r
    //PKA_CTREG(3, 6,8,inv_r);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE, 6, (uint32_t *)secp256r1InvR_P, ECP_SECP256R1_SIZE / 4, 0);
    //R.z ^ -1
    Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE, 2 * ECP_SECP256R1_LT_REG_INDEX - 1, ECP_SECP256R1_SIZE / 4, 1);
    Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE, 2 * ECP_SECP256R1_LT_REG_INDEX, ECP_SECP256R1_SIZE / 4, 1);
    //PKA_MONT2GF(3, 5,3, 5,3, 6);
    Sec_Eng_PKA_Mont2GF(ECP_SECP256R1_REG_TYPE, 5, ECP_SECP256R1_REG_TYPE, 5, ECP_SECP256R1_REG_TYPE, 6,
                        ECP_SECP256R1_LT_REG_TYPE, ECP_SECP256R1_LT_REG_INDEX, ECP_SECP256R1_REG_TYPE, 0);

    //R.x (Montgomery to GF)
    //PKA_MONT2GF(3, 6,3, 2,3, 6);
    Sec_Eng_PKA_Mont2GF(ECP_SECP256R1_REG_TYPE, 6, ECP_SECP256R1_REG_TYPE, 2, ECP_SECP256R1_REG_TYPE, 6,
                        ECP_SECP256R1_LT_REG_TYPE, ECP_SECP256R1_LT_REG_INDEX, ECP_SECP256R1_REG_TYPE, 0);

    //R.x (GF to Affine domain)
    //PKA_MONT2GF(3, 2,3, 5,3, 6);
    Sec_Eng_PKA_Mont2GF(ECP_SECP256R1_REG_TYPE, 2, ECP_SECP256R1_REG_TYPE, 5, ECP_SECP256R1_REG_TYPE, 6,
                        ECP_SECP256R1_LT_REG_TYPE, ECP_SECP256R1_LT_REG_INDEX, ECP_SECP256R1_REG_TYPE, 0);
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE, 2, (uint32_t *)bar_u2_x, ECP_SECP256R1_SIZE / 4);
#ifdef ECDSA_DBG
    MSG("R.x=\r\n");
    bflb_platform_dump(bar_u2_x, ECP_SECP256R1_SIZE);
#endif

    /* Step7 check R.x=r*/
    /* Check Result */
    for (i = 0; i < 8; i++) {
        if (bar_u2_x[i] != r[i]) {
            return -1;
        }
    }

#ifdef ECDSA_DBG
    MSG("Verify success\r\n");
#endif
    return 0;
}

int sec_ecdsa_sign(sec_ecdsa_handle_t *handle, const uint32_t *random_k, const uint32_t *hash, uint32_t hashLenInWord, uint32_t *r, uint32_t *s)
{
    uint32_t k[8];
    uint32_t Rx[8];
    uint32_t Ry[8];
    uint32_t KInvert[8];
    uint32_t maxTry1 = 100;

    /* Pointer check */
    if (handle->privateKey == NULL || hash == NULL || r == NULL || s == NULL) {
        return -1;
    }

    Sec_Eng_PKA_Reset();
    Sec_Eng_PKA_BigEndian_Enable();
    Sec_Eng_Trng_Enable();

    while (maxTry1--) {
        /* step 1 ,get random k*/
        if (random_k == NULL) {
            if (sec_ecc_get_random_value(k, (uint32_t *)secp256r1N, 32) < 0) {
                return -1;
            }
        } else {
            memcpy(k, random_k, 32);
        }

#ifdef ECDSA_DBG
        MSG("Random k:\r\n");
        bflb_platform_dump(k, ECP_SECP256R1_SIZE);
#endif

        /*step 2, calc R=kG*/
        if (sec_ecdsa_get_public_key(handle, k, Rx, Ry) < 0) {
            return -1;
        }

        if (sec_ecc_is_zero((uint8_t *)Rx, 32)) {
            continue;
        }

