Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/hal_drv/src/hal_sec_ecdsa.c
        memcpy(r, Rx, 32);
#ifdef ECDSA_DBG
        MSG("r:\r\n");
        bflb_platform_dump(r, ECP_SECP256R1_SIZE);
#endif
        sec_ecc_basic_parameter_init(handle->ecpId);
        /* step 3,get k^-1*/
        Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE, 5, (uint32_t *)k, ECP_SECP256R1_SIZE / 4, 0);
        Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE, ECP_SECP256R1_N_REG_INDEX, (uint32_t *)secp256r1N, ECP_SECP256R1_SIZE / 4, 0);
        /* Change k to Mont domain */
        /* Clear register for ECP_SECP256R1_LT_REG_INDEX*/
        Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE, 2 * ECP_SECP256R1_LT_REG_INDEX - 1, ECP_SECP256R1_SIZE / 4, 1);
        Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE, 2 * ECP_SECP256R1_LT_REG_INDEX, ECP_SECP256R1_SIZE / 4, 1);
        Sec_Eng_PKA_GF2Mont(ECP_SECP256R1_REG_TYPE, 5, ECP_SECP256R1_REG_TYPE, 5, 256,
                            ECP_SECP256R1_LT_REG_TYPE, ECP_SECP256R1_LT_REG_INDEX, ECP_SECP256R1_REG_TYPE, ECP_SECP256R1_N_REG_INDEX);
#ifdef ECDSA_DBG
        Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE, 5, (uint32_t *)pka_tmp, ECP_SECP256R1_SIZE / 4);
        MSG("GF2Mont Result of k:\r\n");
        bflb_platform_dump(pka_tmp, ECP_SECP256R1_SIZE);
#endif

        /* Get k^-1 in Mont domain */
        Sec_Eng_PKA_MINV(ECP_SECP256R1_REG_TYPE, 6, ECP_SECP256R1_REG_TYPE, 5,
                         ECP_SECP256R1_REG_TYPE, ECP_SECP256R1_N_REG_INDEX, 1);
#ifdef ECDSA_DBG
        Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE, 6, (uint32_t *)KInvert, ECP_SECP256R1_SIZE / 4);
        MSG("k^-1 in Mont:\r\n");
        bflb_platform_dump(KInvert, ECP_SECP256R1_SIZE);
#endif

        /* Change k^-1 into GF domain,now  ECP_SECP256R1_S_REG_INDEX store k^-1*/
        /* Clear register for ECP_SECP256R1_LT_REG_INDEX*/
        Sec_Eng_PKA_Mont2GF(ECP_SECP256R1_REG_TYPE, 5, ECP_SECP256R1_REG_TYPE, 6, ECP_SECP256R1_REG_TYPE, ECP_SECP256R1_INVR_N_REG_INDEX,
                            ECP_SECP256R1_LT_REG_TYPE, ECP_SECP256R1_LT_REG_INDEX, ECP_SECP256R1_REG_TYPE, ECP_SECP256R1_N_REG_INDEX);
        Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE, 5, (uint32_t *)KInvert, ECP_SECP256R1_SIZE / 4);
#ifdef ECDSA_DBG
        MSG("k^-1:\r\n");
        bflb_platform_dump(KInvert, ECP_SECP256R1_SIZE);
#endif

        /* Step 4,r*d     ((e + r * d) / k) */
        Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE, 4, (uint32_t *)handle->privateKey, ECP_SECP256R1_SIZE / 4, 0);
        Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE, 5, (uint32_t *)r, ECP_SECP256R1_SIZE / 4, 0);
        Sec_Eng_PKA_LMUL(ECP_SECP256R1_SLT_REG_TYPE, ECP_SECP256R1_SLT_REG_INDEX, ECP_SECP256R1_REG_TYPE, 4,
                         ECP_SECP256R1_REG_TYPE, 5, 1);
#ifdef ECDSA_DBG
        Sec_Eng_PKA_Read_Data(ECP_SECP256R1_SLT_REG_TYPE, ECP_SECP256R1_SLT_REG_INDEX, (uint32_t *)pka_tmp, ECP_SECP256R1_SIZE / 2);
        MSG("r*d:\r\n");
        bflb_platform_dump(pka_tmp, ECP_SECP256R1_SIZE * 2);
#endif

        /* Step 5,e+r*d   ((e + r * d) / k) */
        Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE, 5, (uint32_t *)hash, ECP_SECP256R1_SIZE / 4, 0);
        Sec_Eng_PKA_LADD(ECP_SECP256R1_SLT_REG_TYPE, ECP_SECP256R1_SLT_REG_INDEX, ECP_SECP256R1_SLT_REG_TYPE, ECP_SECP256R1_SLT_REG_INDEX,
                         ECP_SECP256R1_REG_TYPE, 5, 1);
#ifdef ECDSA_DBG
        Sec_Eng_PKA_Read_Data(ECP_SECP256R1_SLT_REG_TYPE, ECP_SECP256R1_SLT_REG_INDEX, (uint32_t *)pka_tmp, ECP_SECP256R1_SIZE / 2);
        MSG("e+r*d:\r\n");
        bflb_platform_dump(pka_tmp, ECP_SECP256R1_SIZE * 2);
#endif

        /* Step 6,(e+r*d)*k^-1   ((e + r * d) / k) */
        Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE, 5, (uint32_t *)KInvert, ECP_SECP256R1_SIZE / 4, 0);
        Sec_Eng_PKA_LMUL(ECP_SECP256R1_SLT_REG_TYPE, ECP_SECP256R1_SLT_REG_INDEX, ECP_SECP256R1_SLT_REG_TYPE, ECP_SECP256R1_SLT_REG_INDEX,
                         ECP_SECP256R1_REG_TYPE, 5, 1);
#ifdef ECDSA_DBG
        Sec_Eng_PKA_Read_Data(ECP_SECP256R1_SLT_REG_TYPE, ECP_SECP256R1_SLT_REG_INDEX, (uint32_t *)pka_tmp, ECP_SECP256R1_SIZE / 2);
        MSG("(e+r*d)*k^-1:\r\n");
        bflb_platform_dump(pka_tmp, ECP_SECP256R1_SIZE * 2);
#endif
        /*N write only this time,add following operation will not change this register*/
        Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE, ECP_SECP256R1_N_REG_INDEX, (uint32_t *)secp256r1N, ECP_SECP256R1_SIZE / 4, 0);
        Sec_Eng_PKA_MREM(ECP_SECP256R1_REG_TYPE, 4, ECP_SECP256R1_SLT_REG_TYPE, ECP_SECP256R1_SLT_REG_INDEX,
                         ECP_SECP256R1_REG_TYPE, ECP_SECP256R1_N_REG_INDEX, 1);
        Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE, 4, (uint32_t *)s, ECP_SECP256R1_SIZE / 4);
#ifdef ECDSA_DBG
        MSG("s:\r\n");
        bflb_platform_dump(s, ECP_SECP256R1_SIZE);
#endif

        /* Check s zero*/
        if (sec_ecc_is_zero((uint8_t *)s, 32)) {
            continue;
        }

        return 0;
    }

    return -1;
}

int sec_ecdsa_get_private_key(sec_ecdsa_handle_t *handle, uint32_t *private_key)
{
    if (sec_ecc_get_random_value(private_key, (uint32_t *)secp256r1N, 32) < 0) {
        return -1;
    }

    return 0;
}

int sec_ecdsa_get_public_key(sec_ecdsa_handle_t *handle, const uint32_t *private_key, const uint32_t *pRx, const uint32_t *pRy)
{
    return sec_ecdh_get_scalar_point(handle->ecpId, NULL, NULL, private_key, pRx, pRy);
}

int sec_ecc_get_random_value(uint32_t *randomData, uint32_t *maxRef, uint32_t size)
{
    uint32_t maxTry = 100;
    int32_t ret = 0;

    while (maxTry--) {
        ret = Sec_Eng_Trng_Get_Random((uint8_t *)randomData, size);

        if (ret < 0) {
            return -1;
        }

        if (maxRef != NULL) {
            if (sec_ecc_cmp((uint8_t *)maxRef, (uint8_t *)randomData, size) > 0) {
                return 0;
            }
        } else {
            return 0;
        }
    }

    return -1;
}

int sec_eng_trng_enable(void)
{
    return Sec_Eng_Trng_Enable();
}

void sec_eng_trng_disable(void)
{
    Sec_Eng_Trng_Disable();
}

int sec_eng_trng_read(uint8_t data[32])
{
    return Sec_Eng_Trng_Read(data);
}

int sec_ecdh_init(sec_ecdh_handle_t *handle, sec_ecp_type id)
{
    Sec_Eng_PKA_Reset();
    Sec_Eng_PKA_BigEndian_Enable();
    Sec_Eng_Trng_Enable();

    handle->ecpId = id;

    return 0;
}

int sec_ecdh_deinit(sec_ecdh_handle_t *handle)
{
    Sec_Eng_PKA_Reset();

    return 0;
}

int sec_ecdh_get_encrypt_key(sec_ecdh_handle_t *handle, const uint32_t *pkX, const uint32_t *pkY, const uint32_t *private_key, const uint32_t *pRx, const uint32_t *pRy)
{
    return sec_ecdh_get_scalar_point(handle->ecpId, pkX, pkY, private_key, pRx, pRy);
}

int sec_ecdh_get_public_key(sec_ecdh_handle_t *handle, const uint32_t *private_key, const uint32_t *pRx, const uint32_t *pRy)
{
    return sec_ecdh_get_scalar_point(handle->ecpId, NULL, NULL, private_key, pRx, pRy);
}
